{
  "specialRules": [
    {
      "id": "command-vox",
      "name": "Command Vox",
      "description": "Advanced communication system for coordinating battlefield operations",
      "hasValue": false,
      "longText": "Command Vox represents an advanced communication system that allows this unit to coordinate battlefield operations with enhanced efficiency. Units with this rule can communicate with other friendly units over greater distances, coordinate complex tactical maneuvers, and relay critical battlefield intelligence. The Command Vox system provides secure, encrypted communications that cannot be easily intercepted by enemy forces, making it essential for command and control operations.",
      "shortText": "This unit has enhanced communication capabilities for battlefield coordination.",
      "type": "wargear"
    },
    {
      "id": "augury-scanner",
      "name": "Augury Scanner",
      "description": "Advanced sensor system for detecting hidden enemies and threats",
      "hasValue": false,
      "longText": "Augury Scanner represents an advanced sensor system that can detect hidden enemies, concealed threats, and other battlefield hazards that would normally be invisible to standard detection methods. Units with this rule can identify enemy units in cover, detect ambushes, and locate hidden objectives or resources. The Augury Scanner provides enhanced situational awareness and can reveal enemy movements that would otherwise go unnoticed.",
      "shortText": "This unit can detect hidden enemies and threats with advanced sensors.",
      "type": "wargear"
    },
    {
      "id": "auxilia-vexilla",
      "name": "Auxilia Vexilla",
      "description": "Standard bearer carrying the banner of the Solar Auxilia",
      "hasValue": false,
      "longText": "Auxilia Vexilla represents a standard bearer carrying the banner of the Solar Auxilia. This sacred banner serves as a rallying point for nearby friendly units, providing morale bonuses and tactical coordination. The presence of the banner inspires nearby troops and helps maintain unit cohesion during combat. The Auxilia Vexilla can only be carried by one model in a unit, and its presence provides benefits to the entire formation.",
      "shortText": "This unit carries the banner of the Solar Auxilia, providing morale and tactical bonuses.",
      "type": "wargear"
    },
    {
      "id": "cohorts-vexilla",
      "name": "Cohorts Vexilla",
      "description": "Elite standard bearer carrying the banner of the cohort",
      "hasValue": false,
      "longText": "Cohorts Vexilla represents an elite standard bearer carrying the sacred banner of the cohort. This prestigious banner is a symbol of the cohort's honor and tradition, providing enhanced morale bonuses and tactical coordination compared to standard banners. The presence of the Cohorts Vexilla inspires nearby troops to greater acts of valor and helps maintain unit cohesion even in the most desperate situations. Only one model in a unit can carry this elite banner.",
      "shortText": "This unit carries the elite banner of the cohort, providing enhanced morale and tactical bonuses.",
      "type": "wargear"
    },
    {
      "id": "artillery-tercio-commander",
      "name": "Artillery Tercio Commander",
      "description": "Special ability to command Artillery Tercio detachments",
      "hasValue": false,
      "longText": "Artillery Tercio Commander is a special ability that allows this unit to trigger Artillery Tercio detachments. These specialized artillery detachments can only be commanded by units with this ability, representing their specialized training and equipment for coordinating artillery fire support operations. The Artillery Tercio Commander has access to unique tactical options and can coordinate specialized artillery assets for devastating long-range bombardment.",
      "shortText": "This unit can trigger Artillery Tercio detachments.",
      "type": "special-rule"
    },
    {
      "id": "armour-tercio-commander",
      "name": "Armour Tercio Commander",
      "description": "Special ability to command Armour Tercio detachments",
      "hasValue": false,
      "longText": "Armour Tercio Commander is a special ability that allows this unit to trigger Armour Tercio detachments. These specialized armored detachments can only be commanded by units with this ability, representing their specialized training and equipment for coordinating armored warfare operations. The Armour Tercio Commander has access to unique tactical options and can coordinate specialized armored assets for devastating tank assaults and armored breakthroughs.",
      "shortText": "This unit can trigger Armour Tercio detachments.",
      "type": "special-rule"
    },
    {
      "id": "independent-character",
      "name": "Independent Character",
      "description": "This unit can operate independently and join other units",
      "hasValue": false,
      "longText": "Independent Character represents units that can operate independently on the battlefield and have the ability to join other units. These characters are typically officers, heroes, or special individuals who can provide leadership and support to nearby units. Independent Characters can move freely around the battlefield and join or leave units as needed, providing tactical flexibility and command bonuses.",
      "shortText": "This unit can operate independently and join other units.",
      "type": "special-rule"
    },
    {
      "id": "stubborn",
      "name": "Stubborn",
      "description": "This unit is particularly difficult to break in combat",
      "hasValue": false,
      "longText": "Stubborn represents units that are particularly difficult to break in combat, maintaining their resolve even when outnumbered or taking heavy casualties. These units have enhanced morale and are less likely to flee from battle. Stubborn units are often veterans, elite troops, or units with strong leadership who refuse to give ground even in the face of overwhelming odds.",
      "shortText": "This unit is particularly difficult to break in combat.",
      "type": "special-rule"
    },
    {
      "id": "line",
      "name": "Line",
      "description": "This unit can form a defensive line with enhanced capabilities",
      "hasValue": true,
      "longText": "Line represents the ability of a unit to form a defensive line with enhanced capabilities. Units with this rule can coordinate their defensive efforts, providing mutual support and creating a more effective defensive position. The Line rule allows units to work together to create a cohesive defensive formation that is greater than the sum of its parts. This ability is particularly valuable for infantry units that need to hold ground against enemy assaults.",
      "shortText": "This unit can form a defensive line with enhanced capabilities.",
      "type": "special-rule"
    },
    {
      "id": "pistol",
      "name": "Pistol",
      "description": "This weapon can be used in close combat",
      "hasValue": false,
      "longText": "Pistol represents weapons that can be used in close combat situations. These weapons are compact and designed for use at very close range, allowing the wielder to fire them even when engaged in melee combat. Pistols are particularly useful for characters and units that may find themselves in close quarters situations.",
      "shortText": "This weapon can be used in close combat.",
      "type": "special-rule"
    },
    {
      "id": "breaching",
      "name": "Breaching",
      "description": "This weapon is particularly effective against armored targets",
      "hasValue": true,
      "longText": "Breaching represents weapons that are particularly effective against armored targets, fortified positions, and other heavily protected enemies. These weapons have enhanced armor penetration capabilities and can bypass or overcome defensive measures that would stop lesser weapons. Breaching weapons are essential for dealing with heavily armored enemies and fortified positions.",
      "shortText": "This weapon is particularly effective against armored targets.",
      "type": "special-rule"
    },
    {
      "id": "critical-hit",
      "name": "Critical Hit",
      "description": "This weapon has enhanced critical hit capabilities",
      "hasValue": true,
      "longText": "Critical Hit represents weapons that have enhanced critical hit capabilities, allowing them to cause devastating damage on successful critical hits. These weapons are particularly effective at bypassing armor and causing massive damage when they strike true. Critical Hit weapons are often master-crafted or have special properties that make them more lethal than standard weapons.",
      "shortText": "This weapon has enhanced critical hit capabilities.",
      "type": "special-rule"
    },
    {
      "id": "close-order",
      "name": "Close Order",
      "description": "This model can maintain close formation with other models",
      "hasValue": true,
      "longText": "Close Order represents the ability of a model to maintain close formation with other models, allowing for enhanced coordination and tactical flexibility. Models with this rule can work together more effectively in tight formations, providing mutual support and creating more cohesive fighting units. This ability is particularly valuable for command models and leaders who need to coordinate with nearby troops.",
      "shortText": "This model can maintain close formation with other models.",
      "type": "special-rule"
    },
    {
      "id": "hold-the-line",
      "name": "Hold the Line",
      "description": "This model can maintain defensive positions with enhanced resolve",
      "hasValue": true,
      "longText": "Hold the Line represents the ability of a model to maintain defensive positions with enhanced resolve and determination. Models with this rule are particularly effective at holding ground and resisting enemy assaults, even when outnumbered or under heavy pressure. This ability is especially valuable for command models and leaders who need to inspire their troops to stand firm in the face of overwhelming odds.",
      "shortText": "This model can maintain defensive positions with enhanced resolve.",
      "type": "special-rule"
    },
    {
      "id": "deflagrate",
      "name": "Deflagrate",
      "description": "This weapon can cause additional damage through deflagration",
      "hasValue": true,
      "longText": "Deflagrate represents the ability of a weapon to cause additional damage through deflagration effects. When this weapon successfully wounds a target, it can potentially cause additional damage or effects beyond the normal damage. This ability is particularly effective against certain types of targets and can be devastating when used properly.",
      "shortText": "This weapon can cause additional damage through deflagration.",
      "type": "special-rule"
    },
    {
      "id": "duellists-edge",
      "name": "Duellist's Edge",
      "description": "This weapon provides enhanced capabilities in duels",
      "hasValue": true,
      "longText": "Duellist's Edge represents the weapon's enhanced capabilities in one-on-one combat situations. Weapons with this rule are particularly effective when used against single targets or in dueling scenarios, providing additional benefits that make them superior choices for close combat against individual opponents.",
      "shortText": "This weapon provides enhanced capabilities in duels.",
      "type": "special-rule"
    },
    {
      "id": "searchlight",
      "name": "Searchlight",
      "description": "Illuminates targets for improved accuracy",
      "hasValue": false,
      "longText": "A searchlight is a powerful illumination device mounted on vehicles that can light up targets in darkness or poor visibility conditions. This illumination improves targeting accuracy and can reveal hidden enemies. Searchlights are particularly useful in night fighting or in environments with limited visibility.",
      "shortText": "Provides illumination for improved targeting accuracy.",
      "type": "wargear"
    },
    {
      "id": "dozer-blade",
      "name": "Dozer Blade",
      "description": "Reinforced blade for clearing obstacles and terrain",
      "hasValue": false,
      "longText": "A dozer blade is a reinforced blade mounted on the front of vehicles that allows them to clear obstacles, demolish barricades, and traverse difficult terrain more easily. The blade can be used to push aside debris, clear paths through rubble, or create makeshift ramps. Dozer blades are particularly useful for engineering vehicles and those operating in urban or heavily fortified environments.",
      "shortText": "Allows the vehicle to clear obstacles and difficult terrain.",
      "type": "wargear"
    },
    {
      "id": "flare-shield",
      "name": "Flare Shield",
      "description": "Defensive shield that provides protection against incoming fire",
      "hasValue": false,
      "longText": "A flare shield is a defensive energy shield that provides protection against incoming fire and attacks. The shield can deflect or absorb damage from various types of weapons, making the vehicle more survivable in combat. Flare shields are advanced defensive systems that represent the pinnacle of protective technology available to vehicle crews.",
      "shortText": "Provides defensive protection against incoming attacks.",
      "type": "wargear"
    },
    {
      "id": "flare-launchers",
      "name": "Flare Launchers",
      "description": "Ranged weapon that can deploy flares to illuminate targets",
      "hasValue": false,
      "longText": "Flare Launchers represents a ranged weapon that can deploy flares to illuminate targets. Units with this rule can use their weapon to deploy flares, which can be used to illuminate targets or create a temporary beacon. Flare launchers are particularly useful for providing illumination in dark or poorly lit environments, allowing units to see their targets more easily. This ability is particularly valuable for units that operate in low-light conditions or need to provide illumination for other units.",
      "shortText": "This unit can deploy flares to illuminate targets.",
      "type": "wargear"
    },
    {
      "id": "template-hellstorm",
      "name": "Template (Hellstorm)",
      "description": "This weapon can be used to deploy Hellstorm templates",
      "hasValue": false,
      "longText": "Template (Hellstorm) represents the ability of a weapon to deploy Hellstorm templates. Weapons with this rule can be used to deploy Hellstorm templates, which can be used to create a temporary Hellstorm zone. Hellstorm templates are particularly useful for providing cover and protection from enemy fire. This ability is particularly valuable for units that need to create a temporary Hellstorm zone to protect themselves or other units.",
      "shortText": "This weapon can be used to deploy Hellstorm templates.",
      "type": "special-rule"
    },
    {
      "id": "vanguard",
      "name": "Vanguard",
      "description": "This unit can deploy ahead of the main force",
      "hasValue": false,
      "longText": "Vanguard represents the ability of a unit to deploy ahead of the main force, allowing them to secure objectives, scout enemy positions, or establish forward positions before the rest of the army arrives. Vanguard units are typically fast-moving, lightly armored troops who excel at reconnaissance and forward operations.",
      "shortText": "This unit can deploy ahead of the main force.",
      "type": "special-rule"
    },
    {
      "id": "implacable-advance",
      "name": "Implacable Advance",
      "description": "This unit can advance steadily despite enemy fire",
      "hasValue": false,
      "longText": "Implacable Advance represents the ability of a unit to advance steadily toward their objectives despite heavy enemy fire and casualties. These units are particularly determined and can maintain their forward momentum even when taking significant losses.",
      "shortText": "This unit can advance steadily despite enemy fire.",
      "type": "special-rule"
    },
    {
      "id": "officer-of-the-line",
      "name": "Officer of the Line",
      "description": "This unit provides command bonuses to nearby troops",
      "hasValue": false,
      "longText": "Officer of the Line represents a command officer who provides leadership and tactical bonuses to nearby friendly units. These officers are trained in battlefield command and can coordinate multiple units effectively.",
      "shortText": "This unit provides command bonuses to nearby troops.",
      "type": "special-rule"
    },
    {
      "id": "rapid-fire",
      "name": "Rapid Fire",
      "description": "This weapon can fire multiple shots rapidly",
      "hasValue": false,
      "longText": "Rapid Fire represents weapons that can fire multiple shots in quick succession, increasing their effectiveness against multiple targets or improving their chances of hitting a single target.",
      "shortText": "This weapon can fire multiple shots rapidly.",
      "type": "special-rule"
    },
    {
      "id": "first-rank-fire-second-rank-fire",
      "name": "First Rank Fire, Second Rank Fire",
      "description": "This unit can coordinate fire between multiple ranks",
      "hasValue": false,
      "longText": "First Rank Fire, Second Rank Fire represents the ability of a unit to coordinate their fire between multiple ranks, allowing for sustained volleys and improved firepower.",
      "shortText": "This unit can coordinate fire between multiple ranks.",
      "type": "special-rule"
    },
    {
      "id": "bulky",
      "name": "Bulky",
      "description": "This model is particularly large and difficult to transport",
      "hasValue": false,
      "longText": "Bulky represents models that are particularly large, heavy, or unwieldy, making them difficult to transport or maneuver in certain situations.",
      "shortText": "This model is particularly large and difficult to transport.",
      "type": "special-rule"
    },
    {
      "id": "move-through-cover",
      "name": "Move Through Cover",
      "description": "This unit can move through difficult terrain more easily",
      "hasValue": false,
      "longText": "Move Through Cover represents the ability of a unit to traverse difficult terrain, obstacles, and cover more easily than standard units.",
      "shortText": "This unit can move through difficult terrain more easily.",
      "type": "special-rule"
    },
    {
      "id": "slow-and-purposeful",
      "name": "Slow and Purposeful",
      "description": "This unit moves slowly but with great determination",
      "hasValue": false,
      "longText": "Slow and Purposeful represents units that move at a reduced pace but with great determination and purpose, often being more difficult to stop or redirect.",
      "shortText": "This unit moves slowly but with great determination.",
      "type": "special-rule"
    },
    {
      "id": "support-unit",
      "name": "Support Unit",
      "description": "This unit provides support to other friendly units",
      "hasValue": false,
      "longText": "Support Unit represents units that are designed to provide various forms of support to other friendly units, such as fire support, medical aid, or logistical assistance.",
      "shortText": "This unit provides support to other friendly units.",
      "type": "special-rule"
    },
    {
      "id": "rapier-section",
      "name": "Rapier Section",
      "description": "This unit operates as part of a specialized artillery section",
      "hasValue": false,
      "longText": "Rapier Section represents units that operate as part of a specialized artillery section, with enhanced coordination and tactical capabilities.",
      "shortText": "This unit operates as part of a specialized artillery section.",
      "type": "special-rule"
    },
    {
      "id": "heedless",
      "name": "Heedless",
      "description": "This unit ignores certain negative effects",
      "hasValue": false,
      "longText": "Heedless represents units that can ignore certain negative effects, penalties, or restrictions that would normally apply to other units.",
      "shortText": "This unit ignores certain negative effects.",
      "type": "special-rule"
    },
    {
      "id": "bitter-duty",
      "name": "Bitter Duty",
      "description": "This unit performs their duty despite great hardship",
      "hasValue": false,
      "longText": "Bitter Duty represents units that continue to perform their assigned tasks and duties despite facing great hardship, casualties, or adverse conditions.",
      "shortText": "This unit performs their duty despite great hardship.",
      "type": "special-rule"
    },
    {
      "id": "expendable",
      "name": "Expendable",
      "description": "This unit is considered expendable in tactical calculations",
      "hasValue": false,
      "longText": "Expendable represents units that are considered expendable in tactical calculations, often being used for dangerous missions or as sacrificial units.",
      "shortText": "This unit is considered expendable in tactical calculations.",
      "type": "special-rule"
    },
    {
      "id": "feel-no-pain",
      "name": "Feel No Pain",
      "description": "This unit can ignore certain wounds or damage",
      "hasValue": false,
      "longText": "Feel No Pain represents the ability of a unit to ignore or shrug off certain wounds, damage, or injuries that would normally incapacitate other units.",
      "shortText": "This unit can ignore certain wounds or damage.",
      "type": "special-rule"
    },
    {
      "id": "impact",
      "name": "Impact",
      "description": "This unit causes additional damage on charges",
      "hasValue": false,
      "longText": "Impact represents the ability of a unit to cause additional damage or effects when charging into combat, often due to their size, weight, or momentum.",
      "shortText": "This unit causes additional damage on charges.",
      "type": "special-rule"
    },
    {
      "id": "outflank",
      "name": "Outflank",
      "description": "This unit can deploy from unexpected directions",
      "hasValue": false,
      "longText": "Outflank represents the ability of a unit to deploy from unexpected directions or positions, allowing them to attack the enemy from the flank or rear.",
      "shortText": "This unit can deploy from unexpected directions.",
      "type": "special-rule"
    },
    {
      "id": "pre-emptive-strike",
      "name": "Pre-emptive Strike",
      "description": "This unit can attack before the enemy",
      "hasValue": false,
      "longText": "Pre-emptive Strike represents the ability of a unit to launch attacks before the enemy can react, often due to superior speed, reflexes, or tactical positioning.",
      "shortText": "This unit can attack before the enemy.",
      "type": "special-rule"
    },
    {
      "id": "precision-bombardment",
      "name": "Precision Bombardment",
      "description": "This unit can deliver highly accurate artillery fire",
      "hasValue": false,
      "longText": "Precision Bombardment represents the ability of a unit to deliver highly accurate artillery fire, often with reduced scatter or improved targeting.",
      "shortText": "This unit can deliver highly accurate artillery fire.",
      "type": "special-rule"
    },
    {
      "id": "armoured-warfare",
      "name": "Armoured Warfare",
      "description": "This unit is specialized in armored combat",
      "hasValue": false,
      "longText": "Armoured Warfare represents units that are specialized in armored combat, with enhanced capabilities when fighting against or alongside other armored units.",
      "shortText": "This unit is specialized in armored combat.",
      "type": "special-rule"
    },
    {
      "id": "auto-repair",
      "name": "Auto-repair",
      "description": "This unit can repair itself automatically",
      "hasValue": false,
      "longText": "Auto-repair represents the ability of a unit to automatically repair damage or restore functionality without external assistance.",
      "shortText": "This unit can repair itself automatically.",
      "type": "special-rule"
    },
    {
      "id": "light-transport",
      "name": "Light Transport",
      "description": "This unit can transport other units",
      "hasValue": false,
      "longText": "Light Transport represents units that are designed to transport other units, providing mobility and tactical flexibility.",
      "shortText": "This unit can transport other units.",
      "type": "special-rule"
    },
    {
      "id": "independent-fire",
      "name": "Independent Fire",
      "description": "This unit can fire independently of other units",
      "hasValue": false,
      "longText": "Independent Fire represents the ability of a unit to fire their weapons independently of other units, without requiring coordination or support.",
      "shortText": "This unit can fire independently of other units.",
      "type": "special-rule"
    },
    {
      "id": "explodes",
      "name": "Explodes",
      "description": "This unit can explode when destroyed",
      "hasValue": false,
      "longText": "Explodes represents the ability of a unit to cause an explosion when destroyed, potentially damaging nearby units or terrain.",
      "shortText": "This unit can explode when destroyed.",
      "type": "special-rule"
    },
    {
      "id": "suppressive",
      "name": "Suppressive",
      "description": "This weapon can suppress enemy units",
      "hasValue": true,
      "longText": "Suppressive represents the ability of a weapon to suppress enemy units, reducing their effectiveness or preventing them from taking certain actions.",
      "shortText": "This weapon can suppress enemy units.",
      "type": "special-rule"
    },
    {
      "id": "indirect-fire",
      "name": "Indirect Fire",
      "description": "This weapon can fire over obstacles",
      "hasValue": false,
      "longText": "Indirect Fire represents the ability of a weapon to fire over obstacles, cover, or terrain that would normally block line of sight.",
      "shortText": "This weapon can fire over obstacles.",
      "type": "special-rule"
    },
    {
      "id": "melta",
      "name": "Melta",
      "description": "This weapon is particularly effective at close range",
      "hasValue": true,
      "longText": "Melta represents weapons that are particularly effective at close range, often having enhanced damage or armor penetration when used against nearby targets.",
      "shortText": "This weapon is particularly effective at close range.",
      "type": "special-rule"
    },
    {
      "id": "poisoned",
      "name": "Poisoned",
      "description": "This weapon delivers poisoned attacks",
      "hasValue": true,
      "longText": "Poisoned represents weapons that deliver poisoned attacks, which can cause additional effects or damage over time.",
      "shortText": "This weapon delivers poisoned attacks.",
      "type": "special-rule"
    },
    {
      "id": "pinning",
      "name": "Pinning",
      "description": "This weapon can pin enemy units in place",
      "hasValue": true,
      "longText": "Pinning represents the ability of a weapon to pin enemy units in place, preventing them from moving or taking certain actions.",
      "shortText": "This weapon can pin enemy units in place.",
      "type": "special-rule"
    },
    {
      "id": "rending",
      "name": "Rending",
      "description": "This weapon can tear through armor",
      "hasValue": true,
      "longText": "Rending represents weapons that can tear through armor, often having enhanced armor penetration or the ability to bypass certain types of protection.",
      "shortText": "This weapon can tear through armor.",
      "type": "special-rule"
    },
    {
      "id": "shred",
      "name": "Shred",
      "description": "This weapon can shred through targets",
      "hasValue": true,
      "longText": "Shred represents weapons that can shred through targets, often causing additional damage or having enhanced effectiveness against certain types of enemies.",
      "shortText": "This weapon can shred through targets.",
      "type": "special-rule"
    },
    {
      "id": "template",
      "name": "Template",
      "description": "This weapon uses a template for area effect",
      "hasValue": false,
      "longText": "Template represents weapons that use a template to determine their area of effect, allowing them to hit multiple targets within a specific area.",
      "shortText": "This weapon uses a template for area effect.",
      "type": "special-rule"
    },
    {
      "id": "armourbane",
      "name": "Armourbane",
      "description": "This weapon is particularly effective against armored targets",
      "hasValue": false,
      "longText": "Armourbane represents weapons that are particularly effective against armored targets, often having enhanced damage or armor penetration capabilities.",
      "shortText": "This weapon is particularly effective against armored targets.",
      "type": "special-rule"
    },
    {
      "id": "detonation",
      "name": "Detonation",
      "description": "This weapon explodes on impact",
      "hasValue": false,
      "longText": "Detonation represents weapons that explode on impact, causing area damage or additional effects beyond the initial hit.",
      "shortText": "This weapon explodes on impact.",
      "type": "special-rule"
    },
    {
      "id": "panic",
      "name": "Panic",
      "description": "This weapon can cause panic in enemy units",
      "hasValue": true,
      "longText": "Panic represents the ability of a weapon to cause panic in enemy units, potentially causing them to flee or lose their effectiveness.",
      "shortText": "This weapon can cause panic in enemy units.",
      "type": "special-rule"
    },
    {
      "id": "heavy",
      "name": "Heavy",
      "description": "This weapon is heavy and difficult to move",
      "hasValue": true,
      "longText": "Heavy represents weapons that are heavy and difficult to move, often requiring special equipment or reducing the mobility of the unit carrying them.",
      "shortText": "This weapon is heavy and difficult to move.",
      "type": "special-rule"
    },
    {
      "id": "blast",
      "name": "Blast",
      "description": "This weapon causes area damage",
      "hasValue": true,
      "longText": "Blast represents weapons that cause area damage, affecting multiple targets within a specific radius of the impact point.",
      "shortText": "This weapon causes area damage.",
      "type": "special-rule"
    },
    {
      "id": "ordnance",
      "name": "Ordnance",
      "description": "This weapon is classified as ordnance",
      "hasValue": true,
      "longText": "Ordnance represents weapons that are classified as heavy artillery or specialized munitions, often having unique rules or restrictions.",
      "shortText": "This weapon is classified as ordnance.",
      "type": "special-rule"
    },
    {
      "id": "stun",
      "name": "Stun",
      "description": "This weapon can stun enemy units",
      "hasValue": true,
      "longText": "Stun represents the ability of a weapon to stun enemy units, potentially reducing their effectiveness or preventing them from taking certain actions.",
      "shortText": "This weapon can stun enemy units.",
      "type": "special-rule"
    },
    {
      "id": "overload",
      "name": "Overload",
      "description": "This weapon can overload for increased power",
      "hasValue": true,
      "longText": "Overload represents the ability of a weapon to operate at increased power levels, often at the cost of reliability or safety.",
      "shortText": "This weapon can overload for increased power.",
      "type": "special-rule"
    },
    {
      "id": "barrage",
      "name": "Barrage",
      "description": "This weapon can fire in a barrage pattern",
      "hasValue": true,
      "longText": "Barrage represents the ability of a weapon to fire in a barrage pattern, covering a large area with multiple shots or projectiles.",
      "shortText": "This weapon can fire in a barrage pattern.",
      "type": "special-rule"
    },
    {
      "id": "limited",
      "name": "Limited",
      "description": "This weapon has limited ammunition",
      "hasValue": true,
      "longText": "Limited represents weapons that have limited ammunition or uses, restricting how often they can be fired or deployed.",
      "shortText": "This weapon has limited ammunition.",
      "type": "special-rule"
    },
    {
      "id": "shock",
      "name": "Shock",
      "description": "This weapon can cause shock effects",
      "hasValue": true,
      "longText": "Shock represents the ability of a weapon to cause shock effects, potentially stunning, disorienting, or otherwise affecting enemy units.",
      "shortText": "This weapon can cause shock effects.",
      "type": "special-rule"
    },
    {
      "id": "phage",
      "name": "Phage",
      "description": "Reduce a characteristic for the rest of the battle",
      "shortText": "Reduce the value of the characteristic in brackets by 1 for the rest of the battle after an unsaved wound from this weapon.",
      "longText": "Reduce that value motherfucker",
      "hasValue": false,
      "type": "special-rule"
    },
    {
      "id": "skyfire",
      "name": "Skyfire",
      "description": "Shooty shooty airplanes",
      "shortText": "A weapon with this special rule hits flyers at its normal to hit roll.",
      "longText": "Zooooooom bang",
      "hasValue": false,
      "type": "special-rule"
    },
    {
      "id": "rapid-tracking",
      "name": "Rapid Tracking",
      "description": "Not sure what this does",
      "shortText": "Not sure what this does",
      "longText": "Still not sure what this does",
      "hasValue": false,
      "type": "special-rule"
    }
  ]
}